src/test/resources/example/happypoint/internal_payment_fail_request.json

{
  "paymentId": 1510380033207818,
  "userId": 5331586170224640,
  "userName": "",
  "userEmail": "azrael@lezhin.com",
  "coinProductName": "happypoint - 10",
  "amount": 2000.0,
  "currency": "KRW",
  "pgCompany": "happypoint",
  "paymentType": "mhappypoint",
  "store": "plus",
  "storeVersion": "1.0",
  "locale": "ko-KR",
  "state": "R",
  "createdAt": 1510380033208,
  "externalStoreProductId": "lz_dynamic_happypoint_mhappypoint_2000",
  "manual": false,
  "pgPayment": {
    "rcgnKey": "dd50084c773c417f0b75bf1be857e5ddf9582f7ab8480b38e282938a757bbfe7",
    "instCd": "ORJN",
    "tlgmNo": "5121",
    "tlgmChnlCd": "X0",
    "trsDt": "20171107",
    "trsTm": "161021",
    "tracNo": "ORJN20171107161021",
    "tlgmClCd": "ON",
    "rpsCd": "92",
    "rpsMsgCtt": "필수입력항목 거래일자이/가 누락되었습니다.",
    "reqClCd": "10",
    "reqBrndCd": "C083",
    "reqChnlCd": "20",
    "rpsDtlCd": "",
    "rpsDtlMsg": "필수입력항목 거래일자이/가 누락되었습니다.",
    "mbrAuthMthdCd": "20",
    "mbrNo": "1003023370",
    "remPt": "00000000000",
    "mbrIdfWayCd": "20",
    "mchtNo": "100015851",
    "trxDt": "",
    "trxTm": "",
    "trxClCd": "20",
    "trxTypCd": "10",
    "trxRsnCd": "2001",
    "trxAmt": "0000000002000",
    "useReqPt": "00000002000",
    "aprvDt": "",
    "aprvNo": "",
    "usePt": "00000000000"
  }
}